export const pdpaMarkdown = 
`1.	บทนิยาม
    1.1.	"งานวันแรกพบนิสิตใหม่" หมายความว่า กิจกรรมที่จัดต้อนรับนิสิตจุฬาลงกรณ์มหาวิทยาลัยที่ผ่านการคัดเลือกเข้าสู่รั้วจุฬาลงกรณ์มหาวิทยาลัย จัดโดยองค์การบริหารสโมสรนิสิตจุฬาลงกรณ์มหาวิทยาลัย
    1.2.	“งานรับเพื่อนก้าวใหม่” หมายความว่า กิจกรรมที่จัดให้นิสิตใหม่ในจุฬาลงกรณ์มหาวิทยาลัยได้ทำความรู้จักกันตลอดจนได้เข้าร่วมกิจกรรมสันทนาการร่วมกัน จัดโดยองค์การบริหารสโมสรนิสิตจุฬาลงกรณ์มหาวิทยาลัย
    1.3.	“บ้านรับเพื่อน” หมายความว่า กลุ่มนิสิตที่ทำกิจกรรมร่วมกันภายในงานรับเพื่อนก้าวใหม่ประกอบด้วยนิสิตต่างคณะและชั้นปี
    1.4.	"คณะผู้จัดงาน" หมายความว่า คณะกรรมการจัดงานงานวันแรกพบนิสิตใหม่และคณะกรรมการจัดงานรับเพื่อนก้าวใหม่ ปีการศึกษา 2567 
    1.5.	"ข้อมูลส่วนบุคคล" หมายความว่า ข้อมูลที่สามารถเชื่อมโยงกับบุคคลหรือสามารถระบุตัวตนได้เช่น ชื่อตัว ชื่อสกุล หมายเลขโทรศัพท์ รูปภาพ สำเนาบัตรนิสิต เป็นต้น แต่ไม่รวมถึงข้อมูลที่ไม่อาจระบุตัวตนเป็นการเฉพาะได้
    1.6.	"เจ้าของข้อมูลส่วนบุคคล" หมายความว่า บุคคลที่ข้อมูลส่วนบุคคลนั้นระบุไปถึง มิใช่กรณีที่บุคคล มีความเป็นเจ้าของข้อมูลหรือเป็นผู้สร้างหรือเก็บรวบรวมข้อมูลนั้นเองเท่านั้น บุคคลในที่นี้หมายความถึง บุคคลธรรมดาเท่านั้น ไม่รวมไปถึงนิติบุคคลที่จัดตั้งขึ้นตามกฎหมาย
    1.7.	"ประมวลผล" หมายถึง การดำเนินการใด ๆ ต่อข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล ซึ่งรวมถึงการเก็บรวมรวม ใช้ จัดเก็บ เปิดเผย และลบข้อมูลส่วนบุคคล
    1.8.	"ฐานการประมวลผล" หมายถึง เหตุผลความจำเป็นในการประมวลผลข้อมูลส่วนบุคคลตามมาตรา 24 และเงื่อนไขพิเศษในการประมวลผลข้อมูลอ่อนไหวตามมาตรา 26 ของพระราชบัญญัติคุ้มครอง ข้อมูลส่วนบุคคล พ.ศ. 2562

2.	คณะผู้จัดงานมีฐานะเป็นผู้ควบคุมข้อมูลส่วนบุคคลตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคลพ.ศ. 2562 ซึ่งหนังสือฉบับนี้ได้อธิบายว่าคณะผู้จัดงานได้เก็บรวบรวมและใช้ข้อมูลส่วนบุคคลของเจ้าของข้อมูล ส่วนบุคคลตามขอบเขตและวัตถุประสงค์ตามที่ให้ไว้ เจ้าของข้อมูลส่วนบุคคลสามารถติตต่อคณะผู้จัดงานได้ทางช่องทางการติดต่อขององค์การบริหารสโมสรนิสิตจุฬาลงกรณ์มหาวิทยาลัย งานวันแรกพบนิสิตใหม่และงานรับเพื่อนก้าวใหม่

3.	คณะผู้จัดงานได้เก็บรวบรวมและจัดเก็บข้อมูลส่วนบุคคล ดังต่อไปนี้
    3.1.	ข้อมูลอัตลักษณ์ เช่น ชื่อ-นามสกุล ชื่อเล่น
    3.2.	ข้อมูลที่อยู่หรือที่ติดต่อ เช่น เบอร์โทรศัพท์ อีเมล Line ID
    3.3.	ภาพถ่าย และวิดิโอ ในวันที่จัดกิจกรรมงานวันแรกพบนิสิตใหม่และกิจกรรมงานรับเพื่อนก้าวใหม่
    3.4.	ข้อมูลนิสิตจุฬาลงกรณ์มหาวิทยาลัย เช่น คณะ ชั้นปี รุ่น รหัสนิสิต ในกิจกรรมงานวันแรกพบนิสิตใหม่และงานรับเพื่อนก้าวใหม่
นอกจากนี้ คณะผู้จัดงานอาจประมวลผลข้อมูลส่วนบุคคลประเภทพิเศษที่มีความอ่อนไหว อาทิ
    3.5.	ข้อมูลสุขภาพ เช่น โรคประจำตัว ยาที่แพ้ อาหารที่แพ้ ข้อจำกัดทางอาหาร

4.	คณะผู้จัดงานเก็บรวบรวมข้อมูลส่วนบุคคลจากเจ้าของข้อมูลส่วนบุคคลผ่านการรวบรวมข้อมูลโดยคณะผู้จัดงาน

5.	คณะผู้จัดงานได้ใช้ข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคลเพื่อการดำเนินการทั้งหลายตามวัตถุประสงค์เพื่อให้คณะผู้จัดงานใช้สำหรับ
    5.1.	ดำเนินกิจกรรมงานวันแรกพบนิสิตใหม่และกิจกรรมรับเพื่อนก้าวใหม่ ปีการศึกษา 2567
    5.2.	ป้องกันไม่ให้ผู้ที่ไม่เกี่ยวข้องกับงานเข้ามาภายในงานและกระทำการใด ๆ ที่อาจก่อให้เกิดอันตรายแก่ผู้เข้าร่วมกิจกรรม
    5.3.	ยืนยันสถานภาพนิสิตจุฬาลงกรณ์มหาวิทยาลัยของผู้ดำเนินกิจกรรมในส่วนของบ้านรับเพื่อน
		การประมวลผลดังกล่าวอยู่บนฐานของความยินยอมซึ่งเจ้าของข้อมูลส่วนบุคคลได้ให้ความยินยอมในการประมวลผลข้อมูลในหนังสือฉบับนี้ คณะผู้จัดงานจะประมวลผลข้อมูลส่วนบุคคลของเจ้าของข้อมูล ส่วนบุคคลตามวัตถุประสงค์ที่ได้แจ้งไว้เท่านั้น

6.	คณะผู้จัดงานอาจแบ่งปันข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคลให้กับหน่วยงานหรือบุคคลที่สังกัดอยู่ในจุฬาลงกรณ์มหาวิทยาลัยเท่านั้น คณะผู้จัดงานจะไม่แบ่งปันข้อมูลให้กับหน่วยงานหรือบุคคลที่มิได้สังกัดอยู่ในจุฬาลงกรณ์มหาวิทยาลัย เว้นแต่โดยคำสั่งศาล หากเจ้าของข้อมูลส่วนบุคคลให้ความยินยอมคณะผู้จัดงานจะแบ่งปันข้อมูลของเจ้าของข้อมูลส่วนบุคคลตามที่ระบุไว้ในข้อนี้

7.	ภายใต้ขอบเขตและวัตถุประสงค์การประมวลผลตามหนังสือให้ความยินยอมฉบับนี้ คณะผู้จัดงานไม่มีอำนาจส่งหรือโอนข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคลไปยังต่างประเทศ

8.	คณะผู้จัดงานได้จัดให้มีมาตรการรักษาความมั่นคงปลอดภัยสำหรับข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล นอกจากนี้หน่วยงานภายนอกซึ่งประมวลผลข้อมูลส่วนบุคคลให้คณะผู้จัดงานจะต้องตกลงที่จะรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล

9.	คณะผู้จัดงานจะจัดเก็บข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคลภายในระยะเวลาที่จำเป็นในการดำเนินการตามวัตถุประสงค์ของการจัดกิจกรรมงานวันแรกพบนิสิตใหม่หรืองานรับเพื่อนก้าวใหม่ คณะผู้จัดงานจะทำการลบหรือทำลายข้อมูลส่วนบุคคล อันได้แก่ ชื่อตัว ชื่อสกุล หมายเลขโทรศัพท์ สำเนาบัตรนิสิตของเจ้าของข้อมูลส่วนบุคคลภายในระยะเวลา 20 วันหลังกิจกรรมงานวันแรกพบนิสิตใหม่หรืองานรับเพื่อนก้าวใหม่ได้สิ้นสุดลง แล้วแต่กรณี เว้นเเต่ภาพบันทึกของผู้เข้าร่วมกิจกรรมงานซึ่งทางคณะผู้จัดงานนำไปใช้เพื่อการประชาสัมพันธ์เท่านั้น

10.	ภายใต้พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 เจ้าของข้อมูลส่วนบุคคลมีสิทธิดังต่อไปนี้
    10.1.	สิทธิในการเพิกถอนความยินยอมในกรณีที่คณะผู้จัดงานขอความยินยอมของเจ้าของข้อมูล ส่วนบุคคล เพื่อประมวลผลข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล
    10.2.	สิทธิในการเข้าถึงข้อมูลส่วนบุคคล โดยเจ้าของข้อมูลส่วนบุคคลสามารถขอรับสำเนาข้อมูลของเจ้าของข้อมูลส่วนบุคคล และตรวจสอบว่าคณะผู้จัดงานได้ประมวลผลข้อมูลตามกฎหมายหรือไม่
    10.3.	สิทธิในการลบข้อมูลส่วนบุคคล โดยเจ้าของข้อมูลส่วนบุคคลสามารถขอให้ลบ ทำลาย หรือทำให้ข้อมูล ส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวเจ้าของข้อมูลส่วนบุคคลได้ ในกรณีดังต่อไปนี้
        10.3.1.	เมื่อหมดความจำเป็นในการประมวลผลข้อมูลส่วนบุคคล
        10.3.2.	เมื่อเจ้าของข้อมูลส่วนบุคคลถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคล และคณะผู้จัดงานไม่มีฐานการประมวลผลตามกฎหมายที่จะประมวลผลข้อมูลส่วนบุคคลนั้นได้ต่อไป
        10.3.3.	เมื่อข้อมูลส่วนบุคคลถูกประมวลผลโดยไม่ชอบด้วยกฎหมาย
    10.4.	สิทธิในการระงับการใช้ข้อมูลส่วนบุคคล โดยเจ้าของข้อมูลส่วนบุคคลสามารถขอให้ระงับการใช้ข้อมูล ส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคลได้ ในกรณีดังต่อไปนี้
        10.4.1.	เมื่ออยู่ในระหว่างการตรวจสอบตามที่เจ้าของข้อมูลส่วนบุคคลขอให้แก้ไขข้อมูลส่วนบุคคล
        10.4.2.	เมื่อเป็นข้อมูลส่วนบุคคลที่ต้องลบหรือทำลาย แต่เจ้าของข้อมูลส่วนบุคคลขอให้ระงับการใช้แทน
        10.4.3.	เมื่อข้อมูลส่วนบุคคลหมดความจำเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ แต่เจ้าของข้อมูล ส่วนบุคคลมีความจำเป็นต้องขอให้เก็บรักษาไว้เพื่อใช้ในการก่อตั้งสิทธิเรียกร้องตามกฎหมาย การปฏิบัติตามหรือการใช้สิทธิเรียกร้องตามกฎหมาย หรือการยกขึ้นต่อสู้สิทธิเรียกร้องตามกฎหมาย
        10.4.4.	เมื่ออยู่ในระหว่างการพิสูจน์หรือตรวจสอบตามคำขอใช้สิทธิในการคัดค้านของเจ้าของข้อมูล ส่วนบุคคล
    10.5.	สิทธิในการแก้ไขข้อมูลส่วนบุคคล หากเจ้าของข้อมูลส่วนบุคคลพบว่าข้อมูลของเจ้าของข้อมูล ส่วนบุคคลไม่ถูกต้อง ไม่สมบูรณ์ และไม่เป็นปัจจุบัน เจ้าของข้อมูลส่วนบุคคลสามารถขอแก้ไขข้อมูลของเจ้าของข้อมูลส่วนบุคคลได้ เพื่อให้ข้อมูลของเจ้าของข้อมูลส่วนบุคคลถูกต้องสมบูรณ์และเป็นปัจจุบัน

11.	เอกสารฉบับนี้เป็นหนังสือให้ความยินยอมในการเก็บรวมรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลในการเก็บข้อมูลส่วนบุคคลจากผู้ดำเนินกิจกรรมงานวันแรกพบนิสิตใหม่และกิจกรรมงานรับเพื่อนก้าวใหม่ คณะผู้จัดงานขอสงวนสิทธิ์ในการทบทวนและปรับปรุงหนังสือฉบับนี้ ตามที่เห็นสมควร โดยจะแจ้งให้เจ้าของข้อมูลส่วนบุคคลทราบถึงการเปลี่ยนแปลงต่อไป

ข้าพเจ้ายินยอมให้คณะกรรมการจัดงานวันแรกพบนิสิตใหม่และกิจกรรมงานรับเพื่อนก้าวใหม่เก็บรวบรวม ใช้ และเปิดเผยข้อมูล ส่วนบุคคล ตามวัตถุประสงค์ที่ได้แจ้งไว้แล้วในหนังสือให้ความยินยอมฉบับนี้ ข้าพเจ้ารับทราบวิธีการจัดเก็บการประมวลผลข้อมูล และรับทราบสิทธิของข้าพเจ้าตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 โดยละเอียดแล้ว จึงได้ทำเครื่องหมายแสดงความยินยอมในระบบอิเล็กทรอนิกส์ซึ่งคณะผู้จัดงานได้จัดเตรียมไว้เป็นสำคัญโดยถือเอาเครื่องหมายแสดงความยินยอมดังกล่าวแทนการลงลายมือชื่อของข้าพเจ้า

สามารถติดต่อผู้ควบคุมข้อมูลส่วนบุคคลได้ที่

สมาร์ท ( ประธานอำนายการ 1 งานรับเพื่อนก้าวใหม่ )
โทร. 091-034-5191
Line ID : smartdnozzo

มายด์ ( ประธานอำนวยการ 1 งานวันแรกพบนิสิตใหม่ )
โทร. 094-901-9256
Line TEL : 0949019256
`;
