import IActivity from '@/types/activity';

const activities: IActivity[] = [
  {
    name: 'ฐาน CU Sci แอ่น แอน แอ้น',
    image: '/user-card/tv.png',
    category: 'walk-rally',
    description:
      'มีการจัดกิจกรรมเกี่ยวกับการรณรงค์ด้านสิ่งแวดล้อม และนิทรรศการเกี่ยวกับเทคโนโลยีและปัญญาประดิษฐ์',
    content: [
      'แล้วเต่าทะเลล่ะ? : กิจกรรมสาธิตวิธีการจัดการขยะ และบรรยายผลกระทบจากภาวะโลกร้อนต่อสิ่งมีชีวิต โดยความร่วมมือจาก Chula Zero Waste และภาควิชาวิทยาศาสตร์สิ่งแวดล้อม คณะวิทยาศาสตร์',
      'ที่เห็นนั่น ใช่ตัวฉันจริง ๆ หรือเปล่า : นิทรรศการนำเสนอจริยธรรมในการใช้ปัญญาประดิษฐ์ และบอร์ดแสดงความคิดเห็นภายใต้หัวข้อ “เทคโนโลยีก้าวหน้า ปัญญาชนถดถอย”',
      'เชื่อฉันสิ ๆ : กิจกรรมโต้วาทีขนาดย่อมเกี่ยวกับประเด็นที่มีการถกเถียงกันในด้านวิทยาศาสตร์ เช่น ประเด็นเกี่ยวกับอาหาร plant base หรือ ประเด็นเกี่ยวกับเงินทุนในวงการวิทยาศาสตร์ เป็นต้น',
      'สำรวจพิพิธภัณฑ์ : เป็นการเยี่ยมชมพิพิธภัณฑ์วิทยาศาสตร์ 3 แห่ง ได้แก่ พิพิธภัณฑ์พฤกษศาสตร์ พิพิธภัณฑ์ชีววิทยา และพิพิธภัณฑ์วิทยาศาสตร์ทางภาพถ่ายและเทคโนโลยีทางการพิมพ์',
      'แต่งแต้มสีสัน : กิจกรรมระบายสีปูนปลาสเตอร์',
      'ซุ้มกิจกรรมให้ความรู้จากองค์กรภายนอก',
    ],
    id: 'walk-rally-1',
  },
  {
    name: 'ฐาน CU Self',
    image: '/user-card/tv.png',
    category: 'walk-rally',
    description:
      'มีการจัดซุ้มและกิจกรรมภายใต้ประเด็น ‘การค้นหาตัวเอง’ รวมถึง กิจกรรม workshop สำหรับผู้เข้าร่วม',
    content: [
      'Say Hi! to new friends : บอร์ดแลกเปลี่ยนช่องทางการติดต่อ และเปิดโอกาสให้เขียนข้อความต่าง ๆ ถึงเพื่อนใหม่',
      'Be Yourself : กิจกรรมงานประดิษฐ์ DIY เช่น ร้อยลูกปัด จัดดอกไม้ เป็นต้น',
      'Love letter : กิจกรรมเขียนจดหมายถึงตนเองในอนาคต ซึ่งจดหมายฉบับนี้จะถูกส่งไปให้ผู้เขียนในอีก 1 ปีข้างหน้า ซึ่งคือวันที่ 4 สิงหาคม พ.ศ. 2568',
      'เติมเต็มกันและกัน : กิจกรรมระบายสีรูปครึ่งแผ่น ซึ่งจะมีการจับคู่ภาพของตนเองกับภาพของเพื่อนใหม่ที่ติดอยู่บนบอร์ด และแลกช่องทางการติดต่อกับคู่ของตนตามความสมัครใจ',
      'Mirror, mirror with CU108 : ซุ้มกระจกถ่ายรูปแสดงความยินดี',
      '3, 2, 1 smile :) : Photo Booth สำหรับผู้เข้าร่วมกิจกรรม สามารถถ่ายรูปและรับภาพถ่ายเป็นของที่ระลึกได้',
    ],
    id: 'walk-rally-2',
  },
  {
    name: 'ฐาน CU Pol Connect',
    image: '/user-card/tv.png',
    category: 'walk-rally',
    description:
      'มีการจัดนิทรรศการเกี่ยวกับประเด็นสังคมและการเมือง กิจกรรมเสวนา ล้อมวงพูดคุย และบอร์ดแสดงความคิดเห็นในประเด็นต่าง ๆ',
    content: [
      'อีกไกลแค่ไหนจนกว่าฉันจะใกล้ Thailand 4.0 : นิทรรศการแสดงทิศทางการเมืองไทยตั้งแต่รัฐบาล พ.ศ. 2475 จนถึงรัฐบาลชุดปัจจุบัน เพื่อแสดงให้เห็นถึงวิวัฒนาการการของเมืองไทย',
      'Agree or Disagree : บอร์ดแสดงความคิดเห็นเกี่ยวกับประเด็นทางสังคมและการเมืองที่กำลังเป็นกระแส โดยการแปะสติกเกอร์แสดงความเห็นด้วยหรือไม่เห็นด้วย',
      'Poli Talkative : การเสวนาวิชาการภายใต้หัวข้อ “ทิศทางของการเมืองไทยหลังมติผ่านร่างพรบ. สมรสเท่าเทียม”',
      'Mirror, Mirror on the wall, I’m the fairest of them all : บอร์ดแสดงความคิดเห็นเกี่ยวกับประเด็น beauty privilege และมีการเขียนให้กำลังใจ',
      'ซุ้มกิจกรรมจากองค์กรภายในและนอกมหาวิทยาลัย : ซุ้มให้ความรู้และจัดกิจกรรมที่สร้างความตระหนักรู้ด้านสิทธิมนุษยชน และปัญหาแรงงานต่างด้าวในไทย',
    ],
    id: 'walk-rally-3',
  },
  {
    name: 'ฐาน Our CU',
    image: '/user-card/tv.png',
    category: 'walk-rally',
    description:
      'มีการจัดตั้งซุ้มแสดงความยินดีกับนิสิตใหม่ และเป็นการประชาสัมพันธ์ถึงข้อมูลรวมถึงหน่วยงานต่าง ๆ ภายในจุฬาฯ',
    content: [
      'Baby, I’m a CU108 : ซุ้มถ่ายรูปแสดงความยินดีกับนิสิตจุฬารุ่น 108',
      'จุฬานิวัต Tour : กิจกรรมเยี่ยมชมหอประวัติจุฬาฯ เพื่อการเรียนรู้ประวัติศาสตร์ของมหาวิทยาลัย',
      'Please answer me, CU : นิทรรศการตอบคำถามที่พบบ่อยจากนิสิตใหม่ ผ่านการจัดแสดงคำตอบในรูปแบบที่เข้าใจง่าย และน่าสนใจ',
      'Let’s hear from CU108 : บอร์ดแสดงความคิดเห็นสำหรับนิสิตจุฬารุ่น 108 ในประเด็นเกี่ยวกับจุฬา เช่น สำหรับคุณ จุฬาฯคืออะไร คุณคาดหวังอะไรจากจุฬาฯ เป็นต้น',
      'CU Cares U : การจัดตั้งซุ้มให้ข้อมูลความรู้เกี่ยวกับหน่วยงานและองค์กรต่าง ๆ ในจุฬาฯ เช่น Chula Student Wellness, ฝ่ายทุนการศึกษาและบริการนิสิตจุฬาฯ เป็นต้น',
      '10 things I love about CU : กิจกรรมร่วมตอบคำถามเกี่ยวกับจุฬาฯ เพื่อชิงของรางวัล',
      'Let’s make a CU wish ! : กิจกรรมที่ให้นิสิตใหม่เขียนคำปรารถนาของตนลงในโพสท์อิทรูปดาว แล้วนำไปแขวนบนต้นไม้เพื่อเป็นการขอพรให้คำขอนั้นสมหวัง เช่น ขอให้ได้เอช้วน ขอให้เจอเพื่อนที่ดี เป็นต้น',
    ],
    id: 'walk-rally-4',
  },
];

export default activities;
